select ПР."ОТЧЕСТВО", count(distinct ВСЕ."ИД")
from "Н_ЛЮДИ" ПР
         left join "Н_УЧЕНИКИ" У1 on ПР."ИД" = У1."ЧЛВК_ИД"
         join "Н_ЛЮДИ" ВСЕ on ПР."ОТЧЕСТВО" = ВСЕ."ОТЧЕСТВО"
         join "Н_УЧЕНИКИ" У2 on ВСЕ."ИД" = У2."ЧЛВК_ИД"
         join "Н_ПЛАНЫ" on У2."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
         join "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД_ЗАКРЕПЛЕН_ЗА" = "Н_ОТДЕЛЫ"."ИД"
where У1."ИД" is null
  and "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'ВТ'
GROUP BY ПР."ОТЧЕСТВО"
HAVING COUNT(ВСЕ."ОТЧЕСТВО") > 10
ORDER BY ПР."ОТЧЕСТВО"