select "Н_УЧЕНИКИ"."ГРУППА",
       "Н_ЛЮДИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
from "Н_УЧЕНИКИ"
         join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "ЧЛВК_ИД"
         join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_УЧЕНИКИ"."ВИД_ОБУЧ_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
         join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         join "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" on "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
         join "Н_НАПР_СПЕЦ" on "Н_НАПР_СПЕЦ"."ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД"
where "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
  and "Н_УЧЕНИКИ"."КОНЕЦ" = '2012-09-01'
  and ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная' or "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная')
  and "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия'
